<?php
namespace App\Database\Migrations;

class Migration_mst_user_group_data extends \CodeIgniter\Database\Migration {

    public function up()
    {
        $this->db->query("

            INSERT mst_user_group 
            (user_group_name, active_flag, create_date, create_user) 
            VALUES 
            ('ผู้จัดการแผนก IT',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก IT',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก จัดซื้อ',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก จัดซื้อ',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก ผลิต',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก ผลิต',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก ขายและการตลาด',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก ขายและการตลาด',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก ขนส่ง',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก ขนส่ง',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก คลังสินค้า',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก คลังสินค้า',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก วัตถุดิบ',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก วัตถุดิบ',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก วางแผน',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก วางแผน',true,'2013-06-20 10:49:09', 1),
			('พนักงานแผนก ตรวจสอบ',true,'2013-06-20 10:49:09', 1),
			('ผู้จัดการแผนก ตรวจสอบ',true,'2013-06-20 10:49:09', 1)
        ");
    }

    public function down()
    {
        $this->dbforge->drop_table('mst_user_group');
    }
}
?>