INSERT INTO dm_as400_pspagmt1 ("AGENT#",agtitl,agname,aglsnm) VALUES 
(0,NULL,NULL,NULL)
,(100,'ชำระเอง','สาขา','กรุงเทพ')
,(109,'ชำระเอง','สาขา','พระโขนง')
,(116,'ชำระเอง','สาขา','อโศก')
,(118,'ชำระเอง','สาขา','รามอินทรา')
,(119,'ชำระเอง','สาขา','ประชาชื่น')
,(171,'ชำระเอง','สาขา','บางนา')
,(172,'ชำระเอง','สาขา','ดอนเมือง')
,(178,'ชำระเอง','สาขา','วิภาวดีรังสิต')
,(184,'ชำระเอง','สาขา','ลาดพร้าว')
;
INSERT INTO dm_as400_pspagmt1 ("AGENT#",agtitl,agname,aglsnm) VALUES 
(200,'ชำระเอง','สาขา','ธนบุรี')
,(206,'ชำระเอง','สาขา','ภาษีเจริญ')
;